import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class RegexDemo {
    public static void main(String[] args) {

        String text = "Andy: 123";
        String regex = "([A-Z][a-z]+): (?<number>\\d+)";
        Pattern pattern = Pattern.compile(regex);
        Matcher matcher = pattern.matcher(text);

//        matcher.find() -> true
//        matcher.group() -> Andy: 123
//        matcher.group(0) -> Andy: 123
//        matcher.group(1) -> Andy
//        matcher.group(2) -> 123
//        matcher.group("number") -> 123

        // [A-Z][a-z]+ [A-Z][a-z]+ Започваме с голяма буква и след това малки букви (John Smith)
        // [A-Z] Всички големи букви
        // [a-z] Всички малки букви
        // [A-z] Всички малки и големи букви
        // [Ee&] Всички символи в скобите
        // [^abc] Всичко ОСВЕН изброените
        // [0-9] Числата от 0 до 9 ВКЛЮЧИТЕЛНО
        // \d Числата от 0 до 9
        // \D Обратното на \d
        // [1-9]\d? Може да имаме или 2 цифри или една; Използва се за дати, за да няма 01
        // \w Всички знаци от(a-z; A-Z; 0-9; _ )
        // \W Обратното на \w
        // \. Escape .
        // \\\\ Escape \
        // . ВСЕКИ един символ
        // \1 Когато искаме да повторим използвана група
        // ([^>]+) Може да имаме каквото и да е, само да НЕ е затварящ таг(>)
        // \s Празните места и нови редове
        // \S Обратното на \s; split(String pattern); "\\s+"
        // \+\d* Да се среща 0 или повече пъти(*)
        // \+\d+ Да се среща 1 или повече пъти(+)
        // \+\d? Да срещнем този елемент 0 или 1 пъти(?)
        // \+\d{3} Да хване колкото на брой цифри има в скобите
        // \+\d{3,6} От 3 до 6 цифри
        // \+\d{3, } 3 или повече цифри


        // \d{2}-(\w{3})-\d{4} - 22-Jan-2015
        // \d{2} - Да имаме точно 2 цифри (22)
        // (\w{3}) - Да имаме точно 3 символам; Очертано с кръгли скоби - очертава група, която може да бъде използвана (Jan)
        // \d{4} - Да имаме точно 4 цифри (2015)

        // ^(?:Hi|hello),\s*(\w+)$ - Hi, Peter
        // ^(?:Hi|hello) - Да използва Hi или hello
        // ?: - Използва се само, за да се обособи група

        // (?<day>\d{2})-(?<month>\w{3})-(?<year>\d{4}) - 22-Jan-2015
        // (?<day>\d{2}) - Група
        // Когато има ? това ни позволява да и сложим име
        // Ако една група бъде изтрита, тази сед нея заема нейното място
        // Слагаме имена на групите

    }
}
